; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v4)
             (pred_9 ?v9 ?v12)
             (pred_4 ?v13 ?v12)
             (pred_1 ?v8 ?v13 )
	     (pred_11 ?v13)
             (pred_7 ?v7)
             (pred_8 ?v9)
             (pred_12 ?v12)
             (pred_3 ?v13)
             (pred_5 ?v9)
             (pred_2 ?v13)
             (pred_10 ))



(:action op_4
:parameters (?v6 ?v3 ?v2 ?v11)
:precondition (and (pred_7 ?v6) (pred_7 ?v3) (pred_8 ?v2) (pred_12 ?v11)
          (pred_6 ?v6 ?v3) (pred_9 ?v2 ?v11)
                   (pred_4 ?v3 ?v11) (pred_11 ?v6) 
                   (pred_3 ?v3) (pred_5 ?v2))
:effect (and  (pred_2 ?v3) (not (pred_3 ?v3))))


(:action op_1
:parameters (?v6 ?v1)
:precondition (and (pred_7 ?v6) (pred_7 ?v1)
               (pred_11 ?v6) (pred_6 ?v6 ?v1) (pred_2 ?v1))
:effect (and (pred_11 ?v1) (not (pred_11 ?v6))))

(:action op_3
:parameters (?v6 ?v2)
:precondition (and (pred_7 ?v6) (pred_8 ?v2) 
                  (pred_11 ?v6) (pred_1 ?v2 ?v6) (pred_10 ))
:effect (and (pred_5 ?v2)
   (not (pred_1 ?v2 ?v6)) (not (pred_10 ))))


(:action op_5
:parameters (?v6 ?v5 ?v10)
:precondition (and (pred_7 ?v6) (pred_8 ?v5) (pred_8 ?v10)
                  (pred_11 ?v6) (pred_5 ?v10) (pred_1 ?v5 ?v6))
:effect (and (pred_5 ?v5) (pred_1 ?v10 ?v6)
        (not (pred_5 ?v10)) (not (pred_1 ?v5 ?v6))))

(:action op_2
:parameters (?v6 ?v2)
:precondition (and (pred_7 ?v6) (pred_8 ?v2) 
                  (pred_11 ?v6) (pred_5 ?v2))
:effect (and (pred_10 ) (pred_1 ?v2 ?v6) (not (pred_5 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_08 obj_20 obj_12 obj_05 obj_14 obj_06 obj_04 obj_21 obj_10 obj_15 obj_09 obj_01 obj_13 obj_18 obj_16
    obj_02 obj_19
    obj_17 obj_03 obj_07
    )

    (:init
       (pred_10)

       (pred_7 obj_11)
       (pred_7 obj_08)
       (pred_7 obj_20)
       (pred_7 obj_12)
       (pred_7 obj_05)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_04)
       (pred_7 obj_21)
       (pred_7 obj_10)
       (pred_7 obj_15)
       (pred_7 obj_09)
       (pred_7 obj_01)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_16)
       (pred_12 obj_02)
       (pred_12 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_03)
       (pred_8 obj_07)

       (pred_6 obj_11 obj_05)
       (pred_6 obj_11 obj_08)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_20)
       (pred_6 obj_08 obj_11)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_20 obj_08)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_14)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_21 obj_01)
       (pred_6 obj_21 obj_10)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_21)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_09 obj_16)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_21)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_16 obj_09)
       (pred_6 obj_16 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_21)
       (pred_4  obj_06 obj_02)
       (pred_4  obj_14 obj_19)
       (pred_4  obj_21 obj_19)
       (pred_2 obj_11)
       (pred_2 obj_08)
       (pred_2 obj_20)
       (pred_2 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_04)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_09)
       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_18)
       (pred_2 obj_16)

       (pred_9  obj_17 obj_02)
       (pred_9  obj_03 obj_19)
       (pred_9  obj_07 obj_02)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_07 obj_13)
       (pred_11 obj_11)
    )

    (:goal (and
       (pred_1 obj_17 obj_10)
    ))
(:constraints
  (always (not (pred_11 obj_15)))
)
)

; plan
1. (op_1 obj_11 obj_08)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_08)
   goals met: 0 of 1
2. (op_1 obj_08 obj_20)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_20)
   goals met: 0 of 1
3. (op_1 obj_20 obj_12)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_12)
   goals met: 0 of 1
4. (op_1 obj_12 obj_04)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_04)
   goals met: 0 of 1
5. (op_1 obj_04 obj_09)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_17)
   deleted: (pred_1 obj_17 obj_09) (pred_10)
   added: (pred_5 obj_17)
   goals met: 0 of 1
7. (op_1 obj_09 obj_16)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_16)
   goals met: 0 of 1
8. (op_1 obj_16 obj_18)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_18)
   goals met: 0 of 1
9. (op_1 obj_18 obj_13)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_13)
   goals met: 0 of 1
10. (op_1 obj_13 obj_10)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_10)
   goals met: 0 of 1
11. (op_2 obj_10 obj_17)
   deleted: (pred_5 obj_17)
   added: (pred_10) (pred_1 obj_17 obj_10)
   goals met: 1 of 1
